In [1]:
dictionary = {
    'name': ['shubh', 'param', 'gauri', 'devansh'],
    'phone': [8837775945, 8837775945, 9516101606, 9005494444]
}

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame(dictionary)

In [5]:
df

      name       phone
0    shubh  8837775945
1    param  8837775945
2    gauri  9516101606
3  devansh  9005494444

In [6]:
df['name']

0      shubh
1      param
2      gauri
3    devansh
Name: name, dtype: object

In [7]:
df[['name', 'phone']]

      name       phone
0    shubh  8837775945
1    param  8837775945
2    gauri  9516101606
3  devansh  9005494444

In [8]:
df.columns

Index(['name', 'phone'], dtype='object')

In [11]:
df.iloc[2]

name          gauri
phone    9516101606
Name: 2, dtype: object

In [12]:
df.iloc[[0,2,3]]

      name       phone
0    shubh  8837775945
2    gauri  9516101606
3  devansh  9005494444

In [13]:
df.iloc[[0,2,3], 1]

0    8837775945
2    9516101606
3    9005494444
Name: phone, dtype: int64

In [14]:
df.shape

(4, 2)

In [16]:
df.columns

Index(['name', 'phone'], dtype='object')